<?php
/**
 * 魅族商城
 * =========================================================================
 * 版权所有:“年年19”开发小组
 * 网站地址: http://mz.7hyd.com
 * -------------------------------------------------------------------------
 * Author: 陈盛富
 * Date: 2016-10-15
 * =========================================================================
 */
namespace Admin\Model;
use Think\Model;

class PriceStoreModel extends Model{
	//自动验证
	protected $_validate = [		
		['att_id', 'require', 'att_id不能为空！！', 1, ],
		// ['att_id', '','此属性产品已存在，请选择其他属性！！', 2, 'unique' ],
		['price', 'require', '产品价格不能为空！！', 1, ],
		['price', '/^[0-9]+(.[0-9]{2})?$/', '产品价格必须是数字！！', 1, ],
		['store', 'require', '产品库存不能为空！！', 1, ],
		['store', '/^[0-9]+$/', '产品库存必须是数字！！', 1, ],
	];

}